Autodesk.Revit.DB.Analysis.MassSurfaceData.GetFaceReferences
Gets References to the faces that the MassSurfaceData provides properties for.
Remarks:
The results are always references to Faces.  The Reference Type should be REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
Returns:
Returns an array of References to Faces that the MassSurfaceData provides properties for.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.ReferenceElementId
The ElementId of the element whose face the MassSurfaceData primarily refers to.
Remarks:
A MassSurfaceData may represent multiple faces from the same or different elements.  This generally
only happens if the faces are geometrically fully coincident and logically represent
a single building object.  "Interior walls" of the conceptual energy building model is a common
example where two different faces may be represented by a single MassSurfaceData.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.CategoryIdForConceptualSurfaceType
Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData.
Remarks:
This value is determined by starting with the subcategory property and adjusting it according to properties
such as "isSlab" or "isUnderground".
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.IsSlab
Indicates if a floor is a slab.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.IsUnderground
Indicates if the roof, floor, slab, or wall surface reference is underground.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.IsGlazingShaded
Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.IsConceptualConstructionByEnergyData
True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings.
False when the ConceptualConstructionType id is overridden for this MassSurfaceData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialType
material type of mass zone
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The material type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.MaterialId
The visualization material used for the surface for displaying the energy analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.MassLevelDataId
The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData
related to the same mass as the referenced face.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.ConceptualConstructionId
The id of the conceptual construction associated with the reference surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element conceptualConstructionId is not a valid ConceptualConstructionType element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.SurfaceDataSource
Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings
of the Document or are overridden for the surface.
Remarks:
The Construction property is not governed by this setting and
has a separate value to indicate if it is to be synchronized
with EnergyDataSettings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The surface data source does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.SkylightWidth
The length dimension to be used for the sides of each individual square skylight
produced in the grid of auto-generated skylights.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The skylight width is less than eight inches.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.PercentageSkylights
The target percentage of the reference roof surface that is to
be covered with automatically generated skylights.  Revit will use this number when
determining the size, shape, and location of automatically generated skylights.
Remarks:
The resulting coverage of the roof with skylights is not guaranteed to
match this value.  It is a target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage skylights value is between 0.00 and 0.95.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.SillHeight
The height above the level where the bottoms of auto-generated windows will be located.
Remarks:
Will be accurate unless the target glazing percentage cannot be achieved using this height.
In that case, the sillHeight will be ignored and windows will be created below this height.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The sill height is less than zero.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.ShadeDepth
How far any auto-generated shades should extend from the wall surface.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shade depth is less than zero.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.PercentageGlazing
The target percentage of the reference wall surface that is to
be covered with automatically generated windows. Revit will use this number when
determining the size, shape, and location of automatically generated windows.
Remarks:
The resulting coverage of the wall with windows is not guaranteed to
match this value.  It is a target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData.Area
Area of the references that the MassSurfaceData provides properties for.
Remarks:
If it is used, should be greater than zero.  Otherwise, it will be zero.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceData
Holds properties and other data about a face in the MassEnergyAnalyticalModel element.
Remarks:
Properties stored in the MassSurfaceData can be used in regeneration by the MassEnergyAnalyticalModel.
For example, faces of the MassEnergyAnalyticalModel take their material values from the settings
in the MassSurfaceData.
Since:
2012